[
    {
        "author": "Famotibe Omobolanle",
        "profile_link": "https://www.linkedin.com/in/famotibe-omobolanle-8766b6131",
        "text": "Great point! I completely agree with you. Last month, I worked on a project heavily focused on AI integration. Even though I’m a frontend engineer, I decided to take on the backend logic myself. It was an eye-opening experience, and I’m still amazed at how much I learned from it. \n\nSo yes, the more projects you tackle and problems you solve, the better you grow.",
        "timestamp": "13h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Frantz Kati",
        "profile_link": "https://www.linkedin.com/in/bahdcoder",
        "text": "Famotibe Omobolanle this is really great insight. Thanks for sharing, and please keep building.",
        "timestamp": "12h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Joseph Kalu",
        "profile_link": "https://www.linkedin.com/in/joseph-kalu-934506237",
        "text": "I'm starting to love your post Frantz Kati, thanks for sharing this",
        "timestamp": "14h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Frantz Kati",
        "profile_link": "https://www.linkedin.com/in/bahdcoder",
        "text": "Joseph Kalu thanks so much for always reading",
        "timestamp": "12h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Daniel Emerson",
        "profile_link": "https://www.linkedin.com/in/daniel-emerson-games",
        "text": "So as someone who has yet to break into the industry, even with decent qualifications and a good degree, I find this change of mindset to be helpful but I personally have yet to see proof of it working with companies. I'd love any input, but I'm going on 8 months of being out of school now and it doesn't help that the main input of advice is \"keep going and developing\" when I don't have the structure to continue my learning abilities in a real work environment. Again, I would love any replies or insights that you may have.",
        "timestamp": "1h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "BeyondTheory",
        "profile_link": "https://www.linkedin.com/company/nurturebybt/posts",
        "text": "Well said, Frantz Kati! At BeyondTheory, our Nurture Program not only gives aspiring tech talents hands-on experience in building real-world products but also ensures they understand business value and impact. With mentors to guide them, we emphasize being proactive in solving problems and figuring things out independently to foster growth and confidence. It's all about transforming potential into impactful value",
        "timestamp": "12h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Mayowa Falomo",
        "profile_link": "https://www.linkedin.com/in/mayowa-falomo-908875178",
        "text": "Companies choosing not to hire Juniors is a shortsighted move for the state of the software industry as a whole, and software development alone would inevitably suffer for it in the long run.\n\nShipping products gets slower, quality of devs slowly begin to drop, companies now have to pay premium money to retain older more experienced devs instead of paying lesser for devs they should have trained, less attention to details for products since there wasn't any training.\n\nAll in all companies would get the shorter end of the stick later and broadly the software industry, I hope companies do better this year. There's still time!",
        "timestamp": "10h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Jasper de Vries",
        "profile_link": "https://www.linkedin.com/in/jasper-de-vries-68a7a44",
        "text": "Mayowa Falomo as a new tragedy of the commons all companies hope that other companies will do the training work (because it is empathically not just a mindset) to keep up the pool of experienced business focused senior developers to meet demand. I couldn’t agree with you more.",
        "timestamp": "4h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Ties van de Ven",
        "profile_link": "https://www.linkedin.com/in/tiesvandeven",
        "text": "Aren't you just describing some steps to become senior here? These are still skills that need to be developed over the years, they cannot be developed within a month or 2. Hence why it's a junior... they need time and guidance to develop these. This is also the reason why it is good to have juniors in your company and team. By guiding them you are forced to explain and rethink decisions made in the past, and find out the gaps in your own knowledge.",
        "timestamp": "6h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "SAMUEL OKOH",
        "profile_link": "https://www.linkedin.com/in/samuel-okoh-a25b37211",
        "text": "It's not easy, especially with limited resources. This approach risks creating a significant gap between senior and junior developers, making it increasingly difficult for aspiring junior developers to start their careers in organizations. Everyone begins somewhere, and having mentors is crucial to professional growth. Not everything can or should be taught by AI—real-world experience, learning from mistakes, and embracing imperfection are essential components of development. Junior developers deserve opportunities to grow, and organizations should focus on nurturing talent, not just downsizing for profit. Prioritizing short-term gains over long-term development neglects the responsibility of giving back to humanity. As challenges grow daily, we must support one another rather than discourage those genuinely striving to succeed.",
        "timestamp": "13h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "sphelele linda",
        "profile_link": "https://www.linkedin.com/in/sphelele-linda-ab2146188",
        "text": "SAMUEL OKOH Spot On!",
        "timestamp": "9h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Heather Osunga Buyu",
        "profile_link": "https://www.linkedin.com/in/heather-osunga-buyu",
        "text": "Great post, Frantz! Your advice to 'figure things out alone,' focus on business impact, and ship real projects is spot on. Aligning coding with business goals and building beyond pet projects are game-changers for growing as a developer. Thanks for sharing these actionable tips!",
        "timestamp": "56m",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Sandra Lancheros",
        "profile_link": "https://www.linkedin.com/in/sandralancheros",
        "text": "Teams should be composed of several types of people. If everyone is a 'strategic thinker', we would look for a detail- oriented doer to complete the group. On top of that, people require experience to become a strategic thinker: this means you have been in several projects before, so your brain has enough context to plan and take decisions. Unfortunately for junior devs, even if they read a lot of theory, they can't achieve this position. In conclusion: projects need both junior devs and strategic thinkers...and many other qualified types of human beings.",
        "timestamp": "9h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    },
    {
        "author": "Ivett Ördög",
        "profile_link": "https://www.linkedin.com/in/ivett-%C3%B6rd%C3%B6g-03aa9035",
        "text": "While I agree that engineers need to focus more on business outcomes, I think this phrasing is quite counter productive. Imagine reading that as a junior engineer... It is disheartening and false. We do need junior engineers! AI tools are not replacing them, because junior engineers also leveled up with the AI tools. Just because there is an economic downturn, and right now the job market is not great, realistically it won't take long before we will have a shortage of engineers again.",
        "timestamp": "8h",
        "post_url": "https://www.linkedin.com/posts/bahdcoder_stop-being-a-junior-developer-i-used-to-activity-7284471818885718017-Z-Wq?utm_source=share&utm_medium=member_desktop"
    }
]